HEllo this is for data

First going to add the prereqs

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## Let's import the data and look at it

In [4]:
df_features = pd.read_csv('Retaildatakaggle/Features data set.csv')
df_sales = pd.read_csv('Retaildatakaggle/Sales data-set.csv')
df_stores = pd.read_csv('Retaildatakaggle/Stores data-set.csv')

In [5]:
df_features.head()

   Store        Date  Temperature  ...         CPI  Unemployment  IsHoliday
0      1  05/02/2010        42.31  ...  211.096358         8.106      False
1      1  12/02/2010        38.51  ...  211.242170         8.106       True
2      1  19/02/2010        39.93  ...  211.289143         8.106      False
3      1  26/02/2010        46.63  ...  211.319643         8.106      False
4      1  05/03/2010        46.50  ...  211.350143         8.106      False

[5 rows x 12 columns]

In [6]:
df_sales.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [7]:
df_stores.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875